# 1. Importing the required libraries,Importing the data set.

In [103]:
# 1. Importing the required libraries.
import pandas as pd
import numpy as np
import pingouin as pg
import matplotlib.pyplot as plt

In [104]:
#2. Importing the data set.

data = pd.read_csv("C:/Users/ADESH/OneDrive/Desktop/dataset/german_credit_data.csv")

# 3. Displaying the first ten and last ten rows.

In [3]:
#3. Displaying the first ten and last ten rows.
#Displaying thelast ten rows.
data.head(10)

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education
3,3,45,male,2,free,little,little,7882,42,furniture/equipment
4,4,53,male,2,free,little,little,4870,24,car
5,5,35,male,1,free,NaN,NaN,9055,36,education
6,6,53,male,2,own,quite rich,NaN,2835,24,furniture/equipment
7,7,35,male,3,rent,little,moderate,6948,36,car
8,8,61,male,1,own,rich,NaN,3059,12,radio/TV
9,9,28,male,3,own,little,moderate,5234,30,car

In [4]:
#Displaying the last ten rows.
data.tail(10)

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
990,990,37,male,1,own,NaN,NaN,3565,12,education
991,991,34,male,1,own,moderate,NaN,1569,15,radio/TV
992,992,23,male,1,rent,NaN,little,1936,18,radio/TV
993,993,30,male,3,own,little,little,3959,36,furniture/equipment
994,994,50,male,2,own,NaN,NaN,2390,12,car
995,995,31,female,1,own,little,NaN,1736,12,furniture/equipment
996,996,40,male,3,own,little,little,3857,30,car
997,997,38,male,2,own,little,NaN,804,12,radio/TV
998,998,23,male,2,free,little,little,1845,45,radio/TV
999,999,27,male,2,own,moderate,moderate,4576,45,car

# 4.interpret the mean ,min,max,std of dataset.

In [5]:
#4.interpret the mean ,min,max,std of dataset.
data.describe()

        Unnamed: 0          Age          Job  Credit amount     Duration
count  1000.000000  1000.000000  1000.000000    1000.000000  1000.000000
mean    499.500000    35.546000     1.904000    3271.258000    20.903000
std     288.819436    11.375469     0.653614    2822.736876    12.058814
min       0.000000    19.000000     0.000000     250.000000     4.000000
25%     249.750000    27.000000     2.000000    1365.500000    12.000000
50%     499.500000    33.000000     2.000000    2319.500000    18.000000
75%     749.250000    42.000000     2.000000    3972.250000    24.000000
max     999.000000    75.000000     3.000000   18424.000000    72.000000

In [6]:
# interpreting the mean
data.mean()

Unnamed: 0        499.500
Age                35.546
Job                 1.904
Credit amount    3271.258
Duration           20.903
dtype: float64

In [7]:
# interpreting the min
data.min()

Unnamed: 0              0
Age                    19
Sex                female
Job                     0
Housing              free
Credit amount         250
Duration                4
Purpose          business
dtype: object

In [8]:
# interpreting the max
data.max()

Unnamed: 0                   999
Age                           75
Sex                         male
Job                            3
Housing                     rent
Credit amount              18424
Duration                      72
Purpose          vacation/others
dtype: object

In [9]:
# interpreting the Standard Deviation.
data.std()

Unnamed: 0        288.819436
Age                11.375469
Job                 0.653614
Credit amount    2822.736876
Duration           12.058814
dtype: float64

# 5.Size and shape of of dataset.

In [10]:
#5.Size and shape of of dataset.
# size of data.
data.size

10000

In [11]:
'''Total size of our dataset is 10000 .'''

'Total size of our dataset is 10000 .'

In [12]:
# Shape of data.
data.shape

(1000, 10)

In [13]:
'''1000 rows & 10 columns are in  our dataset'''

'1000 rows & 10 columns are in  our dataset'

# 6.give the data types of each column.

In [14]:
#6.give the data types of each column.
data.dtypes

Unnamed: 0           int64
Age                  int64
Sex                 object
Job                  int64
Housing             object
Saving accounts     object
Checking account    object
Credit amount        int64
Duration             int64
Purpose             object
dtype: object

# 7. Checking NA values in dataset.

In [15]:
#7. Checking NA values in dataset.
data.isnull().sum()

Unnamed: 0            0
Age                   0
Sex                   0
Job                   0
Housing               0
Saving accounts     183
Checking account    394
Credit amount         0
Duration              0
Purpose               0
dtype: int64

In [86]:
'''There are total 183 null values in Saving Account & 394 null values in Checking account due to
   which we have to reomve checking account column'''

'There are total 183 null values in Saving Account & 394 null values in Checking account due to\n   which we have to reomve checking account column'

# 8.Checking Categorical data in the dataset.

In [17]:
# 8.Checking Categorical data in the dataset.

data.select_dtypes(include=['object']).columns.tolist()

['Sex', 'Housing', 'Saving accounts', 'Checking account', 'Purpose']

In [ ]:
'''In our dataset we have 5 categorical datatypes data'''

# 9.Understanding the data feature by feature. finding the different range of values and count of it.

In [19]:
#Cheking the uique values from 'Sex' column
data['Sex'].unique()

array(['male', 'female'], dtype=object)

In [20]:
#Counting the uique values from 'Sex' column
data['Sex'].value_counts()

male      690
female    310
Name: Sex, dtype: int64

In [ ]:
'''In Sex column we have two unique values in which 690 males & 310 feamles '''

In [88]:
#Cheking the uique values from 'Housing' column
data['Housing'].unique()

array(['own', 'free', 'rent'], dtype=object)

In [89]:
#Counting the uique values from 'Housing' column
data['Housing'].value_counts()

own     713
rent    179
free    108
Name: Housing, dtype: int64

In [ ]:
'''In Housing Column we have three types own= 713,rent=179,free=108 house '''

In [21]:
# Cheking the uique values from 'Saving accounts' column
data['Saving accounts'].unique()

array([nan, 'little', 'quite rich', 'rich', 'moderate'], dtype=object)

In [22]:
# Counting the uique values from 'Saving accounts' column
data['Saving accounts'].value_counts()

little        603
moderate      103
quite rich     63
rich           48
Name: Saving accounts, dtype: int64

In [ ]:
'''In saving accounts column we have four unique values like 'little=603','moderate=103','quite rich=63','rich=48' '''

In [23]:
# Cheking the uique values from 'Checking account' column
data['Checking account'].unique()

array(['little', 'moderate', nan, 'rich'], dtype=object)

In [24]:
# Counting the uique values from 'Checking account' column
data['Checking account'].value_counts()

little      274
moderate    269
rich         63
Name: Checking account, dtype: int64

In [ ]:
'''In checking account column we have Three unique values like 'little=274' ,'moderate=269','rich=63'  '''

In [25]:
# Cheking the uique values from 'Purpose' column
data['Purpose'].unique()

array(['radio/TV', 'education', 'furniture/equipment', 'car', 'business',
       'domestic appliances', 'repairs', 'vacation/others'], dtype=object)

In [26]:
# Counting the uique values from 'Purpose' column
data['Purpose'].value_counts()

car                    337
radio/TV               280
furniture/equipment    181
business                97
education               59
repairs                 22
vacation/others         12
domestic appliances     12
Name: Purpose, dtype: int64

In [ ]:
'''In purpose column we have eight different perpose like 'radio/TV', 'education', 'furniture/equipment', 'car', 'business',
       'domestic appliances', 'repairs', 'vacation/others' '''

# 10.Renaming the columns with some meaningful names

In [100]:
#10.Renaming the columns with some meaningful names 
data = data.rename(columns = {'Purpose':'Purpose to Credit Amount','Saving accounts':'Saving account types'})
data.head(1)

    Sex Housing Saving account types  Credit amount Purpose to Credit Amount
0  male     own                  NaN           1169                 radio/TV

In [93]:
''' - We rename our some columns such as : ('Purpose'-->'Purpose to Credited Amount')'''

" - We rename our some columns such as : ('Purpose'-->'Purpose to Credited Amount')"

In [ ]:
# Reamoving unwanted columns 
'''-In our dataset we remove some unwanted columns like ( Unnamed: 0,Age,Job,duration,Checking account)

In [ ]:
'''After Processing on our data we got clean usefull data having 3 categorical data columns such 
   name as Sex,Housing,Saving Accounts'''

In [101]:
data.head(5)

      Sex Housing Saving account types  Credit amount Purpose to Credit Amount
0    male     own                  NaN           1169                 radio/TV
1  female     own               little           5951                 radio/TV
2    male     own               little           2096                education
3    male    free               little           7882      furniture/equipment
4    male    free               little           4870                      car

In [ ]:
'''In Our final dataset we have Dependant variable as 'purpose to credit Amount'
   Independant Variables in categorical form such as 'Sex','Housing',"Saving Acooount types"
   Independent numerical form variable is 'Credit amout' '''